src/cf/DataProcessors/Тестирование1СПрофессионал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>Тестирование1СПрофессионал</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектТестирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыТестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделы</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВопросов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследовательноПоВопросам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследовательноПоРазделам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоСложные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Catalogs/Вопросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Вопросы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ОбъектыТестирования</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Разделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравильныйВариантОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВопросаВКомплекте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTMLДокумент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/Тестирование1СПрофессионал/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьМассивРазделовПоОбъектуТестирования(ОТ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
					|Разделы.Ссылка,
					|Разделы.Код КАК Код,
					|Разделы.Наименование,
					|ВложенныйЗапрос.Количество
					|ИЗ
					|	Справочник.Разделы КАК Разделы
					|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Вопросы.Ссылка) КАК Количество,
					|			Вопросы.Раздел КАК Раздел,
					|			ПРЕДСТАВЛЕНИЕ(Вопросы.Раздел) КАК РазделПредставление
					|		ИЗ
					|			Справочник.Вопросы КАК Вопросы
					|		
					|		СГРУППИРОВАТЬ ПО
					|			Вопросы.Раздел) КАК ВложенныйЗапрос
					|		ПО Разделы.Ссылка = ВложенныйЗапрос.Раздел
					|ГДЕ
					|	Разделы.Владелец = &ОбъектТестирования
					|
					|УПОРЯДОЧИТЬ ПО
					|	Код";
	
	Запрос.УстановитьПараметр("ОбъектТестирования", ОТ);
	//Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	МассивРазделов = Новый Массив;
	МассивРазделов.Добавить(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));	
	МассивРазделов.Добавить(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Количество"));	
 
	Возврат МассивРазделов;
	
КонецФункции	

&НаКлиенте
Процедура ОбъектТестированияПриИзменении(Элемент)
	
	Объект.Разделы.Очистить();
	Если Объект.ОбъектТестирования.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделов = ПолучитьМассивРазделовПоОбъектуТестирования(Объект.ОбъектТестирования);
	//Для Сч = 0 По МассивРазделов.Количество() - 1 Цикл
	Для Сч = 0 По МассивРазделов[0].Количество() - 1 Цикл
		ЭлементСписка = Объект.Разделы.Добавить(МассивРазделов[0][Сч],Строка(МассивРазделов[0][Сч])+" ("+Строка(МассивРазделов[1][Сч])+")");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.КоличествоВопросов = 14;
	Объект.НачалоПериода = НачалоМесяца(ТекущаяДата());
	Объект.КонецПериода = НачалоМесяца(ТекущаяДата());
	Объект.ОбъектТестирования = Справочники.ОбъектыТестирования.ERP2;
		
КонецПроцедуры	

&НаКлиенте
Процедура НачатьТестирование(Команда)
	
	Если Объект.НачалоПериода > Объект.КонецПериода 
		Или (Не ЗначениеЗаполнено(Объект.НачалоПериода))
		Или (Не ЗначениеЗаполнено(Объект.КонецПериода)) Тогда
		Вопрос("Неправильно указан период!", РежимДиалогаВопрос.ОК);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ОбъектТестирования) Тогда
		Вопрос("Не выбран объект тестирования!", РежимДиалогаВопрос.ОК);
		Возврат;
	КонецЕсли;
		
	Если Объект.КоличествоВопросов = 0 Тогда
		Сообщить("Укажите количество вопросов, которые будут использованы в тестировании!");
		Возврат;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("ОбъектТестирования", Объект.ОбъектТестирования);
	Структура.Вставить("ДатаНач", Объект.НачалоПериода);
	Структура.Вставить("ДатаКон", Объект.КонецПериода);
	Структура.Вставить("ЧислоВопросов", Объект.КоличествоВопросов);
	
	СписокНужныхРазделов = Новый СписокЗначений;
	Для Каждого Раздел Из Объект.Разделы Цикл
		Если Раздел.Пометка Тогда
			СписокНужныхРазделов.Добавить(Раздел.Значение);
		КонецЕсли;
	КонецЦикла;
	Структура.Вставить("Разделы", СписокНужныхРазделов);
	Структура.Вставить("ПоследовательноПоРазделам", Объект.ПоследовательноПоРазделам);
	Структура.Вставить("ПоследовательноПоВопросам", Объект.ПоследовательноПоВопросам);

	Структура.Вставить("ТолькоСложные", Объект.ТолькоСложные);
	
	ФормаЭлемента = ОткрытьФормуМодально("Обработка.Тестирование1СПрофессионал.Форма.ФормаТестирования", Структура,ЭтаФорма);
	Попытка
		Если ФормаЭлемента = 0 Тогда 
			Сообщить("По заданным параметрам тесты не найдены");
		КонецЕсли;	
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбъектТестированияПриИзменении(Элементы.ОбъектТестирования);
КонецПроцедуры

&НаКлиенте
Процедура РазделыПриИзменении(Элемент)
	
	ЕстьВыбранныеРазделы = Ложь;
	Для Каждого Раздел Из Объект.Разделы Цикл
		Если Раздел.Пометка Тогда
			ЕстьВыбранныеРазделы = Истина;
		КонецЕсли;
	КонецЦикла;

	Элементы.ПоследовательноПоРазделам.Доступность = ЕстьВыбранныеРазделы;
	
КонецПроцедуры
